In [3]:
import pandas as pd

In [4]:
Data=pd.read_excel("Groups.xlsx")
Data

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [5]:
Data.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [8]:
Data.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [9]:
Data.tail(3)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21

In [10]:
Data.shape

(7, 3)

In [11]:
Data.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [12]:
Data.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [13]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes